#include "Geometory.h"

void Geometory::MakeBox()
{
	// 元データの作成
	Vertex vtx[] = {
		//-Z面
		{ {-0.5f,  0.5f, -0.5f},{0.0f, 0.0f} },	//0
		{ { 0.5f,  0.5f, -0.5f},{1.0f, 0.0f} },	//1
		{ {-0.5f, -0.5f, -0.5f},{0.0f, 1.0f} },	//2
		{ { 0.5f, -0.5f, -0.5f},{1.0f, 1.0f} },	//3
		//X
		{ { 0.5f,  0.5f, -0.5f},{0.0f, 0.0f} },	//4
		{ { 0.5f,  0.5f,  0.5f},{1.0f, 0.0f} },	//5
		{ { 0.5f, -0.5f, -0.5f},{0.0f, 1.0f} },	//6
		{ { 0.5f, -0.5f,  0.5f},{1.0f, 1.0f} },	//7
		//Z
		{ { 0.5f,  0.5f,  0.5f},{0.0f, 0.0f} },  //8
		{ {-0.5f,  0.5f,  0.5f},{1.0f, 0.0f} },  //9
		{ { 0.5f, -0.5f,  0.5f},{0.0f, 1.0f} },  //10
		{ {-0.5f, -0.5f,  0.5f},{1.0f, 1.0f} },  //11
		//-X
		{ {-0.5f,  0.5f,  0.5f},{0.0f, 0.0f} },  //12
		{ {-0.5f,  0.5f, -0.5f},{1.0f, 0.0f} },  //13
		{ {-0.5f, -0.5f,  0.5f},{0.0f, 1.0f} },  //14
		{ {-0.5f, -0.5f, -0.5f},{1.0f, 1.0f} },  //15
		//Y
		{ {-0.5f,  0.5f,  0.5f},{0.0f, 0.0f} },  //16
		{ { 0.5f,  0.5f,  0.5f},{1.0f, 0.0f} },  //17
		{ {-0.5f,  0.5f, -0.5f},{0.0f, 1.0f} },  //18
		{ { 0.5f,  0.5f, -0.5f},{1.0f, 1.0f} },  //19
		//Y
		{ {-0.5f, -0.5f, -0.5f},{0.0f, 0.0f} },  //20
		{ { 0.5f, -0.5f, -0.5f},{1.0f, 0.0f} },  //21
		{ {-0.5f, -0.5f,  0.5f},{0.0f, 1.0f} },  //22
		{ { 0.5f, -0.5f,  0.5f},{1.0f, 1.0f} },  //23
	};

	int idx[] = {
		 0, 1, 2,	 1, 3, 2,	
		 4, 5, 6,	 5, 7, 6,
		 8, 9,10,	 9,11,10,
		12,13,14,	13,15,14,
		16,17,18,	17,19,18,
		20,21,22,	21,23,22
	};
	// バッファの作成
	MeshBuffer::Description desc = {};
	desc.pVtx		= vtx;
	desc.vtxCount	= _countof(vtx);				//24 頂点の数
	desc.vtxSize	= sizeof(Vertex);				//20 頂点1つあたりのデータサイズ
	desc.pIdx		= idx;
	desc.idxCount	= _countof(idx);							//インデックスの数
	desc.idxSize	= sizeof(int);					//4 インデックス1つあたりのデータサイズ
	desc.topology	= D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST;
	m_pBox			= new MeshBuffer(desc);
}

void Geometory::MakeCylinder()
{
	//--- 頂点の作成
	// 天面、底面

	// 側面

	//--- インデックスの作成
	// 天面、底面

	// 側面


	//--- バッファの作成
}

void Geometory::MakeSphere()
{
	//--- 頂点の作成

	//--- インデックスの作成

	// バッファの作成
}